      *%METADATA                                                       *
      * %TEXT LF - DVD classés par année                               *
      *%EMETADATA                                                      *
     A          R FMTDVD                    PFILE(DVD)
     A          K ANNEE
