**free
      //%METADATA                                                      *
      // %TEXT Exercice 01 : 1er programmes                            *
      //%EMETADATA                                                     *
dsply 'Ce programme a été créé avec RDI';
*inlr = *on;
