      *%METADATA                                                       *
      * %TEXT P01Fixe : 1er programme                                  *
      *%EMETADATA                                                      *
     C     'Créé par SEU'DSPLY
     C                   eval      *inlr = *on
