**free
      //%METADATA                                                      *
      // %TEXT Exercice 01 : 1er programmes                            *
      //%EMETADATA                                                     *
snd-msg 'Ce programme a été créé avec RDI et envoyer par snd-msg';
*inlr = *on;
