**free
      //%METADATA                                                      *
      // %TEXT Exercice 01 : 1er programmes                            *
      //%EMETADATA                                                     *
dcl-pi *n;
  art_num int(3);
  art_prix zoned(7:2);
end-pi;

dsply art_num;
dsply art_prix;
art_prix = 18.99;
*inlr = *on;
