**free
      //%METADATA                                                      *
      // %TEXT Ex12A : Fichier écran                                   *
      //%EMETADATA                                                     *

dcl-f videodsp1 workstn;

exfmt fmt1;
dsply coddvd;

*inlr = *on;

